download.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:rps="http://namespaces.gsma.org/esim-messaging/1">
	<soap:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:UsernameToken wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<wsse:Username>es2user@CTLX</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Mkf39ycD520kKsv26Nct452wv</wsse:Password>
			</wsse:UsernameToken>
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-BAF9A29EE57CA23EAC144020532126634">
				<wsu:Created>2017-12-12T04:21:31.26Z</wsu:Created>
				<wsu:Expires>2017-12-12T04:22:31.26Z</wsu:Expires>
			</wsu:Timestamp>
		</wsse:Security>
		<wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://gsma.com/ES2/ProfileManagement/ES2-DownloadProfile</wsa:Action>
		<wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">//MySenderDomain/123?MessageDate=2015-01-28T18:29:47Z</wsa:MessageID>
		<wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">https://smdp.gemalto.com?EntityId=2.23.150.2.1.1</wsa:To>
		<wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
			<wsa:Address>https://mno.gemalto.com?EntityId=2.2.1</wsa:Address>
		</wsa:From>
	</soap:Header> 
	<soap:Body>
		<rps:ES2-DownloadProfileRequest>
			<rps:functionCallIdentifier>1</rps:functionCallIdentifier>
			<rps:eid>00608E9</rps:eid>
			<rps:smsrId>1.3.6.1.4.1.31746.1.500.200</rps:smsrId>
			<rps:iccid>898614576718095554</rps:iccid>
		
		</rps:ES2-DownloadProfileRequest>
	</soap:Body>
</soap:Envelope>